###################################################################

# Created by write_sdc on Fri May 26 02:02:07 2023

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_wire_load_model -name G5K -library fsa0m_a_generic_core_ss1p62v125c
set_load -pin_load 1 [get_ports done]
set_load -pin_load 1 [get_ports wr_en_a]
set_load -pin_load 1 [get_ports wr_en_b]
set_load -pin_load 1 [get_ports wr_en_c]
set_load -pin_load 1 [get_ports {addr_a[7]}]
set_load -pin_load 1 [get_ports {addr_a[6]}]
set_load -pin_load 1 [get_ports {addr_a[5]}]
set_load -pin_load 1 [get_ports {addr_a[4]}]
set_load -pin_load 1 [get_ports {addr_a[3]}]
set_load -pin_load 1 [get_ports {addr_a[2]}]
set_load -pin_load 1 [get_ports {addr_a[1]}]
set_load -pin_load 1 [get_ports {addr_a[0]}]
set_load -pin_load 1 [get_ports {addr_b[7]}]
set_load -pin_load 1 [get_ports {addr_b[6]}]
set_load -pin_load 1 [get_ports {addr_b[5]}]
set_load -pin_load 1 [get_ports {addr_b[4]}]
set_load -pin_load 1 [get_ports {addr_b[3]}]
set_load -pin_load 1 [get_ports {addr_b[2]}]
set_load -pin_load 1 [get_ports {addr_b[1]}]
set_load -pin_load 1 [get_ports {addr_b[0]}]
set_load -pin_load 1 [get_ports {addr_c[7]}]
set_load -pin_load 1 [get_ports {addr_c[6]}]
set_load -pin_load 1 [get_ports {addr_c[5]}]
set_load -pin_load 1 [get_ports {addr_c[4]}]
set_load -pin_load 1 [get_ports {addr_c[3]}]
set_load -pin_load 1 [get_ports {addr_c[2]}]
set_load -pin_load 1 [get_ports {addr_c[1]}]
set_load -pin_load 1 [get_ports {addr_c[0]}]
set_load -pin_load 1 [get_ports {in_a[31]}]
set_load -pin_load 1 [get_ports {in_a[30]}]
set_load -pin_load 1 [get_ports {in_a[29]}]
set_load -pin_load 1 [get_ports {in_a[28]}]
set_load -pin_load 1 [get_ports {in_a[27]}]
set_load -pin_load 1 [get_ports {in_a[26]}]
set_load -pin_load 1 [get_ports {in_a[25]}]
set_load -pin_load 1 [get_ports {in_a[24]}]
set_load -pin_load 1 [get_ports {in_a[23]}]
set_load -pin_load 1 [get_ports {in_a[22]}]
set_load -pin_load 1 [get_ports {in_a[21]}]
set_load -pin_load 1 [get_ports {in_a[20]}]
set_load -pin_load 1 [get_ports {in_a[19]}]
set_load -pin_load 1 [get_ports {in_a[18]}]
set_load -pin_load 1 [get_ports {in_a[17]}]
set_load -pin_load 1 [get_ports {in_a[16]}]
set_load -pin_load 1 [get_ports {in_a[15]}]
set_load -pin_load 1 [get_ports {in_a[14]}]
set_load -pin_load 1 [get_ports {in_a[13]}]
set_load -pin_load 1 [get_ports {in_a[12]}]
set_load -pin_load 1 [get_ports {in_a[11]}]
set_load -pin_load 1 [get_ports {in_a[10]}]
set_load -pin_load 1 [get_ports {in_a[9]}]
set_load -pin_load 1 [get_ports {in_a[8]}]
set_load -pin_load 1 [get_ports {in_a[7]}]
set_load -pin_load 1 [get_ports {in_a[6]}]
set_load -pin_load 1 [get_ports {in_a[5]}]
set_load -pin_load 1 [get_ports {in_a[4]}]
set_load -pin_load 1 [get_ports {in_a[3]}]
set_load -pin_load 1 [get_ports {in_a[2]}]
set_load -pin_load 1 [get_ports {in_a[1]}]
set_load -pin_load 1 [get_ports {in_a[0]}]
set_load -pin_load 1 [get_ports {in_b[31]}]
set_load -pin_load 1 [get_ports {in_b[30]}]
set_load -pin_load 1 [get_ports {in_b[29]}]
set_load -pin_load 1 [get_ports {in_b[28]}]
set_load -pin_load 1 [get_ports {in_b[27]}]
set_load -pin_load 1 [get_ports {in_b[26]}]
set_load -pin_load 1 [get_ports {in_b[25]}]
set_load -pin_load 1 [get_ports {in_b[24]}]
set_load -pin_load 1 [get_ports {in_b[23]}]
set_load -pin_load 1 [get_ports {in_b[22]}]
set_load -pin_load 1 [get_ports {in_b[21]}]
set_load -pin_load 1 [get_ports {in_b[20]}]
set_load -pin_load 1 [get_ports {in_b[19]}]
set_load -pin_load 1 [get_ports {in_b[18]}]
set_load -pin_load 1 [get_ports {in_b[17]}]
set_load -pin_load 1 [get_ports {in_b[16]}]
set_load -pin_load 1 [get_ports {in_b[15]}]
set_load -pin_load 1 [get_ports {in_b[14]}]
set_load -pin_load 1 [get_ports {in_b[13]}]
set_load -pin_load 1 [get_ports {in_b[12]}]
set_load -pin_load 1 [get_ports {in_b[11]}]
set_load -pin_load 1 [get_ports {in_b[10]}]
set_load -pin_load 1 [get_ports {in_b[9]}]
set_load -pin_load 1 [get_ports {in_b[8]}]
set_load -pin_load 1 [get_ports {in_b[7]}]
set_load -pin_load 1 [get_ports {in_b[6]}]
set_load -pin_load 1 [get_ports {in_b[5]}]
set_load -pin_load 1 [get_ports {in_b[4]}]
set_load -pin_load 1 [get_ports {in_b[3]}]
set_load -pin_load 1 [get_ports {in_b[2]}]
set_load -pin_load 1 [get_ports {in_b[1]}]
set_load -pin_load 1 [get_ports {in_b[0]}]
set_load -pin_load 1 [get_ports {in_c[31]}]
set_load -pin_load 1 [get_ports {in_c[30]}]
set_load -pin_load 1 [get_ports {in_c[29]}]
set_load -pin_load 1 [get_ports {in_c[28]}]
set_load -pin_load 1 [get_ports {in_c[27]}]
set_load -pin_load 1 [get_ports {in_c[26]}]
set_load -pin_load 1 [get_ports {in_c[25]}]
set_load -pin_load 1 [get_ports {in_c[24]}]
set_load -pin_load 1 [get_ports {in_c[23]}]
set_load -pin_load 1 [get_ports {in_c[22]}]
set_load -pin_load 1 [get_ports {in_c[21]}]
set_load -pin_load 1 [get_ports {in_c[20]}]
set_load -pin_load 1 [get_ports {in_c[19]}]
set_load -pin_load 1 [get_ports {in_c[18]}]
set_load -pin_load 1 [get_ports {in_c[17]}]
set_load -pin_load 1 [get_ports {in_c[16]}]
set_load -pin_load 1 [get_ports {in_c[15]}]
set_load -pin_load 1 [get_ports {in_c[14]}]
set_load -pin_load 1 [get_ports {in_c[13]}]
set_load -pin_load 1 [get_ports {in_c[12]}]
set_load -pin_load 1 [get_ports {in_c[11]}]
set_load -pin_load 1 [get_ports {in_c[10]}]
set_load -pin_load 1 [get_ports {in_c[9]}]
set_load -pin_load 1 [get_ports {in_c[8]}]
set_load -pin_load 1 [get_ports {in_c[7]}]
set_load -pin_load 1 [get_ports {in_c[6]}]
set_load -pin_load 1 [get_ports {in_c[5]}]
set_load -pin_load 1 [get_ports {in_c[4]}]
set_load -pin_load 1 [get_ports {in_c[3]}]
set_load -pin_load 1 [get_ports {in_c[2]}]
set_load -pin_load 1 [get_ports {in_c[1]}]
set_load -pin_load 1 [get_ports {in_c[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rst]
set_max_fanout 20 [get_ports start]
set_max_fanout 20 [get_ports {m[3]}]
set_max_fanout 20 [get_ports {m[2]}]
set_max_fanout 20 [get_ports {m[1]}]
set_max_fanout 20 [get_ports {m[0]}]
set_max_fanout 20 [get_ports {k[3]}]
set_max_fanout 20 [get_ports {k[2]}]
set_max_fanout 20 [get_ports {k[1]}]
set_max_fanout 20 [get_ports {k[0]}]
set_max_fanout 20 [get_ports {n[3]}]
set_max_fanout 20 [get_ports {n[2]}]
set_max_fanout 20 [get_ports {n[1]}]
set_max_fanout 20 [get_ports {n[0]}]
set_max_fanout 20 [get_ports {out_a[31]}]
set_max_fanout 20 [get_ports {out_a[30]}]
set_max_fanout 20 [get_ports {out_a[29]}]
set_max_fanout 20 [get_ports {out_a[28]}]
set_max_fanout 20 [get_ports {out_a[27]}]
set_max_fanout 20 [get_ports {out_a[26]}]
set_max_fanout 20 [get_ports {out_a[25]}]
set_max_fanout 20 [get_ports {out_a[24]}]
set_max_fanout 20 [get_ports {out_a[23]}]
set_max_fanout 20 [get_ports {out_a[22]}]
set_max_fanout 20 [get_ports {out_a[21]}]
set_max_fanout 20 [get_ports {out_a[20]}]
set_max_fanout 20 [get_ports {out_a[19]}]
set_max_fanout 20 [get_ports {out_a[18]}]
set_max_fanout 20 [get_ports {out_a[17]}]
set_max_fanout 20 [get_ports {out_a[16]}]
set_max_fanout 20 [get_ports {out_a[15]}]
set_max_fanout 20 [get_ports {out_a[14]}]
set_max_fanout 20 [get_ports {out_a[13]}]
set_max_fanout 20 [get_ports {out_a[12]}]
set_max_fanout 20 [get_ports {out_a[11]}]
set_max_fanout 20 [get_ports {out_a[10]}]
set_max_fanout 20 [get_ports {out_a[9]}]
set_max_fanout 20 [get_ports {out_a[8]}]
set_max_fanout 20 [get_ports {out_a[7]}]
set_max_fanout 20 [get_ports {out_a[6]}]
set_max_fanout 20 [get_ports {out_a[5]}]
set_max_fanout 20 [get_ports {out_a[4]}]
set_max_fanout 20 [get_ports {out_a[3]}]
set_max_fanout 20 [get_ports {out_a[2]}]
set_max_fanout 20 [get_ports {out_a[1]}]
set_max_fanout 20 [get_ports {out_a[0]}]
set_max_fanout 20 [get_ports {out_b[31]}]
set_max_fanout 20 [get_ports {out_b[30]}]
set_max_fanout 20 [get_ports {out_b[29]}]
set_max_fanout 20 [get_ports {out_b[28]}]
set_max_fanout 20 [get_ports {out_b[27]}]
set_max_fanout 20 [get_ports {out_b[26]}]
set_max_fanout 20 [get_ports {out_b[25]}]
set_max_fanout 20 [get_ports {out_b[24]}]
set_max_fanout 20 [get_ports {out_b[23]}]
set_max_fanout 20 [get_ports {out_b[22]}]
set_max_fanout 20 [get_ports {out_b[21]}]
set_max_fanout 20 [get_ports {out_b[20]}]
set_max_fanout 20 [get_ports {out_b[19]}]
set_max_fanout 20 [get_ports {out_b[18]}]
set_max_fanout 20 [get_ports {out_b[17]}]
set_max_fanout 20 [get_ports {out_b[16]}]
set_max_fanout 20 [get_ports {out_b[15]}]
set_max_fanout 20 [get_ports {out_b[14]}]
set_max_fanout 20 [get_ports {out_b[13]}]
set_max_fanout 20 [get_ports {out_b[12]}]
set_max_fanout 20 [get_ports {out_b[11]}]
set_max_fanout 20 [get_ports {out_b[10]}]
set_max_fanout 20 [get_ports {out_b[9]}]
set_max_fanout 20 [get_ports {out_b[8]}]
set_max_fanout 20 [get_ports {out_b[7]}]
set_max_fanout 20 [get_ports {out_b[6]}]
set_max_fanout 20 [get_ports {out_b[5]}]
set_max_fanout 20 [get_ports {out_b[4]}]
set_max_fanout 20 [get_ports {out_b[3]}]
set_max_fanout 20 [get_ports {out_b[2]}]
set_max_fanout 20 [get_ports {out_b[1]}]
set_max_fanout 20 [get_ports {out_b[0]}]
set_max_fanout 20 [get_ports {out_c[31]}]
set_max_fanout 20 [get_ports {out_c[30]}]
set_max_fanout 20 [get_ports {out_c[29]}]
set_max_fanout 20 [get_ports {out_c[28]}]
set_max_fanout 20 [get_ports {out_c[27]}]
set_max_fanout 20 [get_ports {out_c[26]}]
set_max_fanout 20 [get_ports {out_c[25]}]
set_max_fanout 20 [get_ports {out_c[24]}]
set_max_fanout 20 [get_ports {out_c[23]}]
set_max_fanout 20 [get_ports {out_c[22]}]
set_max_fanout 20 [get_ports {out_c[21]}]
set_max_fanout 20 [get_ports {out_c[20]}]
set_max_fanout 20 [get_ports {out_c[19]}]
set_max_fanout 20 [get_ports {out_c[18]}]
set_max_fanout 20 [get_ports {out_c[17]}]
set_max_fanout 20 [get_ports {out_c[16]}]
set_max_fanout 20 [get_ports {out_c[15]}]
set_max_fanout 20 [get_ports {out_c[14]}]
set_max_fanout 20 [get_ports {out_c[13]}]
set_max_fanout 20 [get_ports {out_c[12]}]
set_max_fanout 20 [get_ports {out_c[11]}]
set_max_fanout 20 [get_ports {out_c[10]}]
set_max_fanout 20 [get_ports {out_c[9]}]
set_max_fanout 20 [get_ports {out_c[8]}]
set_max_fanout 20 [get_ports {out_c[7]}]
set_max_fanout 20 [get_ports {out_c[6]}]
set_max_fanout 20 [get_ports {out_c[5]}]
set_max_fanout 20 [get_ports {out_c[4]}]
set_max_fanout 20 [get_ports {out_c[3]}]
set_max_fanout 20 [get_ports {out_c[2]}]
set_max_fanout 20 [get_ports {out_c[1]}]
set_max_fanout 20 [get_ports {out_c[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  -clock_fall  1  [get_ports rst]
set_input_delay -clock clk  -clock_fall  1  [get_ports start]
set_input_delay -clock clk  -clock_fall  1  [get_ports {m[3]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {m[2]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {m[1]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {m[0]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {k[3]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {k[2]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {k[1]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {k[0]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {n[3]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {n[2]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {n[1]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {n[0]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[31]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[30]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[29]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[28]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[27]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[26]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[25]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[24]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[23]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[22]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[21]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[20]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[19]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[18]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[17]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[16]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[15]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[14]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[13]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[12]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[11]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[10]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[9]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[8]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[7]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[6]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[5]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[4]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[3]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[2]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[1]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_a[0]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[31]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[30]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[29]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[28]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[27]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[26]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[25]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[24]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[23]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[22]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[21]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[20]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[19]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[18]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[17]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[16]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[15]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[14]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[13]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[12]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[11]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[10]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[9]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[8]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[7]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[6]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[5]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[4]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[3]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[2]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[1]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_b[0]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[31]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[30]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[29]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[28]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[27]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[26]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[25]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[24]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[23]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[22]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[21]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[20]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[19]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[18]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[17]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[16]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[15]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[14]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[13]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[12]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[11]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[10]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[9]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[8]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[7]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[6]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[5]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[4]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[3]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[2]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[1]}]
set_input_delay -clock clk  -clock_fall  1  [get_ports {out_c[0]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports done]
set_output_delay -clock clk  -clock_fall  1  [get_ports wr_en_a]
set_output_delay -clock clk  -clock_fall  1  [get_ports wr_en_b]
set_output_delay -clock clk  -clock_fall  1  [get_ports wr_en_c]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[7]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[6]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[5]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[4]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[3]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[2]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[1]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_a[0]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[7]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[6]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[5]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[4]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[3]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[2]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[1]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_b[0]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[7]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[6]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[5]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[4]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[3]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[2]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[1]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {addr_c[0]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[31]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[30]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[29]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[28]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[27]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[26]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[25]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[24]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[23]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[22]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[21]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[20]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[19]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[18]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[17]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[16]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[15]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[14]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[13]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[12]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[11]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[10]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[9]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[8]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[7]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[6]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[5]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[4]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[3]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[2]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[1]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_a[0]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[31]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[30]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[29]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[28]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[27]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[26]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[25]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[24]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[23]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[22]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[21]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[20]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[19]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[18]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[17]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[16]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[15]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[14]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[13]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[12]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[11]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[10]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[9]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[8]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[7]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[6]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[5]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[4]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[3]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[2]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[1]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_b[0]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[31]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[30]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[29]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[28]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[27]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[26]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[25]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[24]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[23]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[22]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[21]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[20]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[19]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[18]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[17]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[16]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[15]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[14]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[13]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[12]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[11]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[10]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[9]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[8]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[7]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[6]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[5]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[4]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[3]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[2]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[1]}]
set_output_delay -clock clk  -clock_fall  1  [get_ports {in_c[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst]
set_drive 1  [get_ports start]
set_drive 1  [get_ports {m[3]}]
set_drive 1  [get_ports {m[2]}]
set_drive 1  [get_ports {m[1]}]
set_drive 1  [get_ports {m[0]}]
set_drive 1  [get_ports {k[3]}]
set_drive 1  [get_ports {k[2]}]
set_drive 1  [get_ports {k[1]}]
set_drive 1  [get_ports {k[0]}]
set_drive 1  [get_ports {n[3]}]
set_drive 1  [get_ports {n[2]}]
set_drive 1  [get_ports {n[1]}]
set_drive 1  [get_ports {n[0]}]
set_drive 1  [get_ports {out_a[31]}]
set_drive 1  [get_ports {out_a[30]}]
set_drive 1  [get_ports {out_a[29]}]
set_drive 1  [get_ports {out_a[28]}]
set_drive 1  [get_ports {out_a[27]}]
set_drive 1  [get_ports {out_a[26]}]
set_drive 1  [get_ports {out_a[25]}]
set_drive 1  [get_ports {out_a[24]}]
set_drive 1  [get_ports {out_a[23]}]
set_drive 1  [get_ports {out_a[22]}]
set_drive 1  [get_ports {out_a[21]}]
set_drive 1  [get_ports {out_a[20]}]
set_drive 1  [get_ports {out_a[19]}]
set_drive 1  [get_ports {out_a[18]}]
set_drive 1  [get_ports {out_a[17]}]
set_drive 1  [get_ports {out_a[16]}]
set_drive 1  [get_ports {out_a[15]}]
set_drive 1  [get_ports {out_a[14]}]
set_drive 1  [get_ports {out_a[13]}]
set_drive 1  [get_ports {out_a[12]}]
set_drive 1  [get_ports {out_a[11]}]
set_drive 1  [get_ports {out_a[10]}]
set_drive 1  [get_ports {out_a[9]}]
set_drive 1  [get_ports {out_a[8]}]
set_drive 1  [get_ports {out_a[7]}]
set_drive 1  [get_ports {out_a[6]}]
set_drive 1  [get_ports {out_a[5]}]
set_drive 1  [get_ports {out_a[4]}]
set_drive 1  [get_ports {out_a[3]}]
set_drive 1  [get_ports {out_a[2]}]
set_drive 1  [get_ports {out_a[1]}]
set_drive 1  [get_ports {out_a[0]}]
set_drive 1  [get_ports {out_b[31]}]
set_drive 1  [get_ports {out_b[30]}]
set_drive 1  [get_ports {out_b[29]}]
set_drive 1  [get_ports {out_b[28]}]
set_drive 1  [get_ports {out_b[27]}]
set_drive 1  [get_ports {out_b[26]}]
set_drive 1  [get_ports {out_b[25]}]
set_drive 1  [get_ports {out_b[24]}]
set_drive 1  [get_ports {out_b[23]}]
set_drive 1  [get_ports {out_b[22]}]
set_drive 1  [get_ports {out_b[21]}]
set_drive 1  [get_ports {out_b[20]}]
set_drive 1  [get_ports {out_b[19]}]
set_drive 1  [get_ports {out_b[18]}]
set_drive 1  [get_ports {out_b[17]}]
set_drive 1  [get_ports {out_b[16]}]
set_drive 1  [get_ports {out_b[15]}]
set_drive 1  [get_ports {out_b[14]}]
set_drive 1  [get_ports {out_b[13]}]
set_drive 1  [get_ports {out_b[12]}]
set_drive 1  [get_ports {out_b[11]}]
set_drive 1  [get_ports {out_b[10]}]
set_drive 1  [get_ports {out_b[9]}]
set_drive 1  [get_ports {out_b[8]}]
set_drive 1  [get_ports {out_b[7]}]
set_drive 1  [get_ports {out_b[6]}]
set_drive 1  [get_ports {out_b[5]}]
set_drive 1  [get_ports {out_b[4]}]
set_drive 1  [get_ports {out_b[3]}]
set_drive 1  [get_ports {out_b[2]}]
set_drive 1  [get_ports {out_b[1]}]
set_drive 1  [get_ports {out_b[0]}]
set_drive 1  [get_ports {out_c[31]}]
set_drive 1  [get_ports {out_c[30]}]
set_drive 1  [get_ports {out_c[29]}]
set_drive 1  [get_ports {out_c[28]}]
set_drive 1  [get_ports {out_c[27]}]
set_drive 1  [get_ports {out_c[26]}]
set_drive 1  [get_ports {out_c[25]}]
set_drive 1  [get_ports {out_c[24]}]
set_drive 1  [get_ports {out_c[23]}]
set_drive 1  [get_ports {out_c[22]}]
set_drive 1  [get_ports {out_c[21]}]
set_drive 1  [get_ports {out_c[20]}]
set_drive 1  [get_ports {out_c[19]}]
set_drive 1  [get_ports {out_c[18]}]
set_drive 1  [get_ports {out_c[17]}]
set_drive 1  [get_ports {out_c[16]}]
set_drive 1  [get_ports {out_c[15]}]
set_drive 1  [get_ports {out_c[14]}]
set_drive 1  [get_ports {out_c[13]}]
set_drive 1  [get_ports {out_c[12]}]
set_drive 1  [get_ports {out_c[11]}]
set_drive 1  [get_ports {out_c[10]}]
set_drive 1  [get_ports {out_c[9]}]
set_drive 1  [get_ports {out_c[8]}]
set_drive 1  [get_ports {out_c[7]}]
set_drive 1  [get_ports {out_c[6]}]
set_drive 1  [get_ports {out_c[5]}]
set_drive 1  [get_ports {out_c[4]}]
set_drive 1  [get_ports {out_c[3]}]
set_drive 1  [get_ports {out_c[2]}]
set_drive 1  [get_ports {out_c[1]}]
set_drive 1  [get_ports {out_c[0]}]
